//                           დავალება 1-ლი

// მომხმარებელს შემოატანინეთ რიცხვი და გამოიტანეთ მისი კვადრატი

let numn = alert("დავალება 1-ლი :");
let num = prompt("შეიყვანეთ რიცხვი :");
console.log("დავალება 1-ლი :");
console.log("რიცხვის კვადრატია :" + " " + num * num);
let numn11 = alert("თქვენს მიერ შეყვანილი მაგალითის შედეგს რომ გაეცნოთ გთხოვთ console შეამოწმეთ") 

//                           დავალება მე-2

// შექმენით კალკულატორი: მომხმარებელი შემოიყვანს ორ რიცხვს და შესაბამის მოქმედებას

let numn2 = alert("დავალება მე-2 :");
console.log("დავალება მე-2 :")
let n1 = Number(prompt("შეიყვანეთ პირველი რიცხვი :"));
let n2 = Number(prompt("შეიყვანეთ მეორე რიცხვი :"));
let op = prompt("შეიყვანეთ შესაბამისი მოქმედება (+, -, *, /)");

if (op === "+") {
    alert(n1 + n2);
} else if (op === "-") {
    alert(n1 - n2);
} else if (op === "*") {
    alert(n1 * n2);
} else if (op === "/") {
    alert(n1 / n2);
} else {
    alert("თქვენი სურვილი არ შეესაბამება ჩვენს პირობას, გთხოვთ ხელახლა სცადეთ ");
} 

let numn22 = alert("თქვენს მიერ შეყვანილი მაგალითის შედეგს რომ გაეცნოთ გთხოვთ console შეამოწმეთ") 



//                           დავალება მე-3

// მომხმარებელმა შეიყვანოს სახელი და თუ ემთხვევა ჩემს სახელს- გამოიტანეთ 'გილოცავ'
// (არ აქვს მნიშვნელობა პატარა ასო იქნება თუ დიდი ასო)

let numn3 = alert("დავალება მე-3 :");
console.log("დავალება მე-3 :")
let myName = "გიორგი";
let userName = prompt("შეიყვანე შენი სახელი");

if (userName.toLowerCase() === myName.toLowerCase()) {
    alert("გილოცავ ჩვენ სეხნიები ვართ");
} else {
    alert("სალამი"+userName+ "მე გიორგი მქვია დიდი პატივია თქვენი გაცნობა" );
}


//                           დავალება მე-4

// მომხმარებელმა შეიყვანოს რიცხვი და შეამოწმეთ ლუწია თუ კენტი

let numn4 = alert("დავალება მე-4 :");
console.log("დავალება მე-4 :")
let num4 = prompt("შეიყვანე რიცხვი");
if (num4 % 2 === 0) {
    console.log("თქვენს მიერ შეყვანილი რიცხვი ლუწია");
} else {
    console.log("თქვენს მიერ შეყვანილი რიცხვი კენტია");
}
let numn44 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ") 



//                           დავალება მე-5

// წლოვანების შემოწმება
let numn5 = alert("დავალება მე-5 :");
console.log("დავალება მე-5 :")
let age = prompt("შეიყვანეთ თქვენი წლოვანება :");
if (age < 18) {
    console.log("თქვენ არასრულწლოვანი ბრძანდებით");
} else {
    alert("თქვენ ზრდასრული მამაკაცი ან ქალბატონი ბრძანდებით");
}
let numn55 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება მე-6

// საყვარელი ფერის შემოწმება
let numn6 = alert("დავალება მე-6 :");
console.log("დავალება მე-6 :")
let myColor = "შინდისფერი";
let favColor = prompt("შეიყვანეთ თქვენი საყვარელი ფერი");

if (favColor.toLowerCase() === myColor.toLowerCase()) {
    alert("მე და თქვენ ერთნაირი გემოვნება გვაქვს🎨");
} else {
    alert("მშვენიერი გემოვნებაის ფერია "+favColor+",ჩემი საყვარელი ფერი კი შინდისფერია");
}


//                           დავალება მე-7

// მომხმარებელმა შეიყვანოს რიცხვი და შეადაროს ჩემსას

let numn7 = alert("დავალება მე-7 :");
console.log("დავალება მე-7 :")
let myNum = 7;
let userNum = prompt("შეიყვანეთ თქვენი რიცხვი :");
console.log(userNum == myNum ? "ჩვენი რიცხვები ემთხვევა ერთმანეთს" : "ჩვენი რიცხვები არ ემთხვევა ერთმანეთს");
let numn77 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება მე-8

// მომხმარებელმა შეიყვანოს ორი რიცხვი და გამოიტანოს მაქსიმალური რიცხვი

let numn8 = alert("დავალება მე-8 :");
let num8_1 = Number(prompt("შეიყვანეთ პირველი რიცხვი :"));
let num8_2 = Number(prompt("შეივანეთ მეორე რიცხვი :"));

if (num8_1 > num8_2) {
    console.log("თქვენს მიერ არჩეულ რიცხვებს შორის მაქსიმალური რიცხვია =", num8_1);
} else {
    console.log("თქვენს მიერ არჩეულ რიცხვებს შორის მაქსიმალური რიცხვია =", num8_2);
}
let numn88 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი რიცხვის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება მე-9

// შემოწმება: დადებითი, უარყოფითი თუ ნულია
let numn9 = alert("დავალება მე-9 :");
let num9 = prompt("შეიყვანე რიცხვი");

if (num9 > 0) {
    console.log("დადებითი");
} else if (num9 < 0) {
    console.log("უარყოფითი");
} else {
    console.log("ნულის ტოლია");
}
let numn99 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი რიცხვის შედეგი გთხოვთ console შეამოწმეთ")


//                           დავალება მე-10

// პაროლის შემოწმება
let numn10 = alert("დავალება მე-9 :");
let myPass = "12345";
let userPass = prompt("შეიყვანეთ პაროლი :");

if (userPass === myPass) {
    console.log("პაროლი სწორია ✅");
} else {
    console.log("არასწორია პაროლი ❌");
}
let numn100 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება 11

// მომხმარებელმა შეიყვანოს თვე (1-12) და გამოიტანეთ თითოეული  თვე და სეზონი
let numn111 = alert("დავალება მე-9 :");
let month = prompt("შეიყვანე თვე");

if (month == 1) console.log("იანვარი - ზამთარი");
else if (month == 2) console.log("თებერვალი - ზამთარი");
else if (month == 3) console.log("მარტი - გაზაფხული");
else if (month == 4) console.log("აპრილი - გაზაფხული");
else if (month == 5) console.log("მაისი - გაზაფხული");
else if (month == 6) console.log("ივნისი - ზაფხული");
else if (month == 7) console.log("ივლისი - ზაფხული");
else if (month == 8) console.log("აგვისტო - ზაფხული");
else if (month == 9) console.log("სექტემბერი - შემოდგომა");
else if (month == 10) console.log("ოქტომბერი - შემოდგომა");
else if (month == 11) console.log("ნოემბერი - შემოდგომა");
else if (month == 12) console.log("დეკემბერი - ზამთარი");
else alert("ასეთი სახელის მქონე თვე ვერ მოიძებნა , გთხოვთ ხელახლა სცადეთ");
let numn1111 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება 12

// შემოწმება იყოფა თუ არა 3-ზე
let numn12 = alert("დავალება მე-12 :");
let num12 = prompt("შეიყვანეთ რიცხვი :");

if (num12 % 3 === 0) {
    console.log("თქვენი რიცხვი იყოფა 3-ზე");
} else {
    console.log("თვენი რიცხვი არ იყოფა 3-ზე");
}
let numn122 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება 13

// ქულის შემოწმება (0-100)
let numn13 = alert("დავალება მე-13 :");
let score = prompt("შეიყვანე ქულა");

if (score >= 51) {
    console.log("გამოცდა წარმატებით ჩააბარეთ ✅ , გისურვებთ წარმატებას და ბედნიერებას ");
} else {
    console.log("გამოცდაში ჩიაჭერით ❌ , შემდეგში უფრო კარგად მოემზადეთ");
}
let numn133 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება 14

// ორი ასაკის შედარება

let numn14 = alert("დავალება მე-14 :");
let age1 = prompt("შეიყვანეთ პირველი წლოვანება :");
let age2 = prompt("შეიყვანეთ მეორე წლოვანება :");

if (age1 == age2) {
    console.log("ისინი თანაკლასელები არიან");
} else {
    console.log("მათი წლოვანება განსხვავებულია");
}

let numn144 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")
//                           დავალება 15

// კვირის დღის შემოწმება

let numn15 = alert("დავალება მე-15 :");
let day = prompt("შეიყვანეთ რიცხვი რათა მიიღოთ შესაბამისი კვირის დღე (1-7)");

if (day == 1) console.log("ორშაბათი");
else if (day == 2) console.log("სამშაბათი");
else if (day == 3) console.log("ოთხშაბათი");
else if (day == 4) console.log("ხუთშაბათი");
else if (day == 5) console.log("პარასკევი");
else if (day == 6) console.log("შაბათი");
else if (day == 7) console.log("კვირა");
else console.log("არასწორი რიცხვი");
let numn155 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება 16

// ტემპერატურის შემოწმება

let numn16 = alert("დავალება მე-16 :");
let temp = prompt("შეიყვანე ამინდის ტემპერატურა");

if (temp < 0) {
    console.log("ცივა და თბილად ჩაიცვი");
} else if (temp >= 0 && temp <= 25) {
    console.log("მშვენიერი ამიონდია სასეირნოდ");
} else {
    console.log("ცხელა");
}
let numn166 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება 17

// რთული შემოწმება

let numn17 = alert("დავალება მე-17 :");
let num17 = prompt("შეიყვანე რიცხვი");

if (num17 > 20) {
    if (num17 % 2 === 0) {
        console.log("თქვენი რიცხვი ლუწია და ნამრავლი =", num17 * 2);
    } else {
        console.log("თქვენი რიცხვი კენტია და ნამრავლი =", num17 * 3);
    }
} else if (num17 % 3 === 0) {
    console.log("თქვენი რიცხვი იყოფა 3-ზე =", num17 / 3);
} else {
    console.log("რიცხვი იგივეა =", num17);
}
let numn177 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება 18

// მინი ჯეირანი (ქვა, მაკრატელი, ფურცელი)
let numn18 = alert("დავალება მე-18 :");
let userChoice = prompt("აირჩიე: ქვა, მაკრატელი ან ფურცელი");
let myChoice = "ქვა";

if (userChoice === myChoice) {
    console.log("თანაბარი ანგარიშით დავასრულეთ, გილოცავთ ");
} else if (
    (userChoice === "ქვა" && myChoice === "მაკრატელი") ||
    (userChoice === "მაკრატელი" && myChoice === "ფურცელი") ||
    (userChoice === "ფურცელი" && myChoice === "ქვა")
) {
    console.log("თქვენ მოიგეთ");
} else {
    console.log("მე მოვიგე 😎");
}
let numn188 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება 19

// პაროლის შემოწმება + რეგისტრაცია

let numn19 = alert("დავალება მე-9 :");
let myPassword = "12345";
let inputPassword = prompt("შეიყვანე პაროლი");

if (inputPassword === myPassword) {
    let firstName = prompt("შეიყვანე სახელი");
    let lastName = prompt("შეიყვანე გვარი");
    let age = prompt("შეიყვანე ასაკი");

    if (lastName.toLowerCase() === "წიბლიაშვილი") {
        console.log("თქვენ წარმატებით გაიარეთ რეგისტრაცია ✅");
    } else {
        console.log("რეგისტრაცია თქვენს მიერ შეყვანილი მონაცემების შედეგად დასრულდა ხარვეზებით ❌");
    }
} else {
    console.log("არასწორი პაროლია , სცადეთ ხელახლა");
}
let numn199 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება 20

// სამი რიცხვის ჯამის შემოწმება

let numn20 = alert("დავალება მე-20 :");
let n20_1 = Number(prompt("პირველი რიცხვი"));
let n20_2 = Number(prompt("მეორე რიცხვი"));
let n20_3 = Number(prompt("მესამე რიცხვი"));

let sum20 = n20_1 + n20_2 + n20_3;

if (sum20 % 2 === 0) {
    console.log("საშუალო =", sum20 / 3);
} else {
    console.log("ნამრავლი 2-ზე =", sum20 * 2);
}
let numn200 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")

//                           დავალება 21

// if / else / else if ახსნა

/*
 if – თუ პირობა მართალია
 else if – სხვა პირობის შემოწმება
 else – თუ არაფერი არ შესრულდა
*/

let numn21 = alert("დავალება 21-ე :");
let checkAge = prompt("შეიყვანეთ წლოვანება");

if (checkAge < 18) {
    console.log("პიროვნება არასრულწლოვანია");
} else if (checkAge >= 18 && checkAge < 60) {
    console.log("პიროვნება ზრდასრულია");
} else {
    console.log("პიროვნება ხანდაზმულია");
}
let numn211 = alert("იმისთვის რომ იხილოთ თქვენს მიერ შეყვანილი პასუხის შედეგი გთხოვთ console შეამოწმეთ")