<<<<<<< HEAD
#დავალება 1

# 0-იდან 20-ის ჩათვლით გამოიტანეთ რიცხვები.

# for chad in range(0,20)
#     print(chad)


#დავალება 2

# მომხმარებელს შემოატანინეთ ორი რიცხვი და მათ შორის არსებულები გამოიტანეთ.

#number_1=int(input ("Enter Your Name :"))
#number_2=int(input("Enter Your number :"))

#for chad in range(number_1,number_2):
#    print(chad)
        


#დავალება 3

# 50-იდან 100-ის ჩათვლით გამოიტანეთ რიცხვები.

#for chad in range(50,101):
#    print(chad)




#დავალება 4

# დაიწყეთ 100-დან და 50-ის ჩათვლით გამოიტანეთ რიცხვები. (ჩათვალეთ დავალება 3-ის საპირისპირო) 

#for chad in range(100,49,-1):
#    print(chad)



#დავალება 5

# 0-იდან 50-ის ჩათვლით გამოიტანეთ რიცხვები და ბოლოს მათი ჯამი.

#number_1=0
#for chad in range(0,51):
#    number_1 +- chad



#დავალება 6

# მომხმარებელს შეეკითხეთ რომ შემოიტანოს მთელი რიცხვი. შემდეგ 0-დან ამ რიცხვამდე გამოიტანეთ ყველა მთელი რიცხვი.

#number_1=int(input("Enter Your number :"))

#for chad in range(0,number_1):
#    print(chad)



#დავალება 7

# მომხმარებელს შეეკითხეთ ასაკი. შექმენით ცვლადი, სადაც შენახული იქნება 10 წლის შემდეგ მომხმარებლის ასაკი. საბოლოოდ დაპრინტეთ მომხმარებლის ასაკსა და 10 წლის შემდეგ წლოვანებას შორის არსებული მთელი რიცხვები. 

#number_1=int(input('Enter your age :'))
#number_2 = number_1 + 10
#for chad in range(number_1 , number_2):
#    print(chad) 
=======
#დავალება 1

# 0-იდან 20-ის ჩათვლით გამოიტანეთ რიცხვები.

# for chad in range(0,20)
#     print(chad)


#დავალება 2

# მომხმარებელს შემოატანინეთ ორი რიცხვი და მათ შორის არსებულები გამოიტანეთ.

#number_1=int(input ("Enter Your Name :"))
#number_2=int(input("Enter Your number :"))

#for chad in range(number_1,number_2):
#    print(chad)
        


#დავალება 3

# 50-იდან 100-ის ჩათვლით გამოიტანეთ რიცხვები.

#for chad in range(50,101):
#    print(chad)




#დავალება 4

# დაიწყეთ 100-დან და 50-ის ჩათვლით გამოიტანეთ რიცხვები. (ჩათვალეთ დავალება 3-ის საპირისპირო) 

#for chad in range(100,49,-1):
#    print(chad)



#დავალება 5

# 0-იდან 50-ის ჩათვლით გამოიტანეთ რიცხვები და ბოლოს მათი ჯამი.

#number_1=0
#for chad in range(0,51):
#    number_1 +- chad



#დავალება 6

# მომხმარებელს შეეკითხეთ რომ შემოიტანოს მთელი რიცხვი. შემდეგ 0-დან ამ რიცხვამდე გამოიტანეთ ყველა მთელი რიცხვი.

#number_1=int(input("Enter Your number :"))

#for chad in range(0,number_1):
#    print(chad)



#დავალება 7

# მომხმარებელს შეეკითხეთ ასაკი. შექმენით ცვლადი, სადაც შენახული იქნება 10 წლის შემდეგ მომხმარებლის ასაკი. საბოლოოდ დაპრინტეთ მომხმარებლის ასაკსა და 10 წლის შემდეგ წლოვანებას შორის არსებული მთელი რიცხვები. 

#number_1=int(input('Enter your age :'))
#number_2 = number_1 + 10
#for chad in range(number_1 , number_2):
#    print(chad) 
>>>>>>> f092f856632ec5ccc336b5c70e406374e97d4149
