# რა არის პითონი პროგრამირებაში?
#      ა)გველი         ბ)დათვი         გ)პროგრამული ენა          დ)პროგრამული მოდული
#                      სწორი პასუხია:პროგრამული ენა

# რა არის turtle-ი  pithon-ში?
#      ა)library         ბ)turtle         გ)Date type          დ)variable
#                      სწორი პასუხია:library
from turtle import*
exitonclick() #მართლაც turtle-ი არის library

# რას გამოიტანს ეს კოდი ტერმინალში?
print('heloo world')

#      ა)Hello world         ბ)heloo world         გ)"helloo world"          დ)error
#                      სწორი პასუხია:heloo world

# რას გამოიტანს ეს კოდი ტერმინალში?
print(True > False)

#      ა)None         ბ)false         გ)false          დ)Error
#                      სწორი პასუხია:True
# მართლაც ტერმინალში ამ კოდმა გამოიტანა True

# რითი ვქმნით კომენტარს  pithon-ში? 
#      ა) //          ბ) |**|        გ) #          დ) <!-- --> 
#                       სწორი პასუხია: #comment
#-დიახ ამ ნიშნით იწერება კომენტარი pithon-ში

# რას გამოიტანს ეს კოდი ტერმინალში?
x = 15
y = 4
print(x // y)

#      ა)3          ბ)4         გ)15          დ)imposible
#                      სწორი პასუხია:3
# მართლაც ტერმინალში ამ კოდმა გამოიტანა: 3

# რას გამოიტანს ეს კოდი ტერმინალში?
x = 10
y = 4
print(x / y)

#      ა)4          ბ)Error         გ)2.5          დ)2
#                       სწორი პასუხია: 2.5
# მართლაც ტერმინალში ამ კოდმა გამოიტანა: 2.5

# რას გამოიტანს ეს კოდი ტერმინალში?
x = 10
y = "20"
print(x + y)

#      ა)Error          ბ)40         გ)1020          დ) x + y
#                       სწორი პასუხია:Error
# მართლაც ტერმინალში ამ კოდმა გამოიტანა: Error
 
# რას გამოიტანს ეს კოდი ტერმინალში?
x = 5
y = 2
print(x ** y)

#      ა)2          ბ)25         გ)15          დ)243
#                       სწორი პასუხია:25
# მართლაც ტერმინალში ამ კოდმა გამოიტანა: 25
   
# if მუშაობს else-ის გარეშე.
#               ა)true     ბ)false
#                       სწორი პასუხია:true
 
# რითი მთავრდება for loop?
#      ა)end          ბ)...         გ)or          დ)break
#                       სწორი პასუხია:break

# რა იქნება თუ 10 % 3 ?
#      ა)3          ბ)1         გ)5          დ)Error
#                       სწორი პასუხია:1

# integer-ი მრავლდება string-ზე.
#               ა)true     ბ)false
#                       სწორი პასუხია:true

# რას გამოიტანს ეს კოდი ტერმინალში?
print(3>4 or 3<5 and 500 < 400 or 320 > 244)

#      ა)Error          ბ)true         გ)false          დ) i don't know
#                       სწორი პასუხია:true

# რა არის სია list?
#      ა)library          ბ)integer         გ)Array          დ)string
#                       სწორი პასუხია:Array
# ამ კითხვაზე ლოგიკურად უნდა გემსჯელათ

# რა არის ალგორითმი?
#      ა)ტყის მცველი          ბ)მგელი         გ)ჯადოქარი           დ)მოქმედების,ნაბიჯ-ნაბიჯ შესრულება <3
#                       სწორი პასუხია: მოქმედების,ნაბიჯ-ნაბიჯ შესრულება <3 
# ამ კითხვაზე ლოგიკურად უნდა გემსჯელათ
 
# პითონი გველია თუ კუდი?
#      ა)კუდი          ბ)გველი         გ)თოკი           დ)პირამიდა
#                       სწორი პასუხია:გველი

# დავითი უსმენს როკის სტილის მუსიკას.
#               ა)true     ბ)false
#                       სწორი პასუხია:true

# ბატონი გაბრიელი არ უსმენს მამა პაპურ ქართულ მუსიკებს.
#               ა)true     ბ)false
#                       სწორი პასუხია:false

# გაკვეთილი ჩატარდა კანფეტივით.
#              ა)true     ბ)false
#                       სწორი პასუხია:true

# რომელი ხინკალი ჯობია?
#      ა)ქუთაისური          ბ)ფასანაურული         გ)გერმანული           დ)საჩხერის
#                       სწორი პასუხია: ფასანაურული                       
