def robertas_water():
    print("hello")
    print("გადადგი 4 ნაბიჯი წინ")
    print("შეუხვიე მარცხნივ")
    print("გადადგი 2 ნაბიჯი წინ")
    print("მოუშვი ცივი წყალი")
    print("შეუხვიე მარცხნივ")
    print("გადადგი 4 ნაბიჯი წინ")
    print("შეუხვიე მარცხნივ")
    print("გადადგი 2 ნაბიჯი წინ")
    print("გადადგი 4 ნაბიჯი წინ")
    print("შეუხვიე მარცხნივ")
    print("გადადგი 2 ნაბიჯი წინ")
    print("გადადგი 4 ნაბიჯი წინ")
    print("შეუხვიე მარცხნივ")
    print("გადადგი 2 ნაბიჯი წინ")











robertas_water()
