# function

# print()
# input()
# str()
# int()
# type()
# len()



# თქვენ შექმნათ თქვენი საკუთარი ფუნქციები

# print("გამოვედი სახლიდან")
# print("გავუყევი გზას")
# print("გადავჭერი გზა")
# print("შევუხვიე მარცხნივ")
# print("ვიარე წინ")
# print("შევუხვიე მარცხნივ")
# print("გაიარე ციხის გზა")
# print("ჩაუარეთ მარგეს შაურმას")
# print("მივედით მაგაზიაში")


# create define

def waymarket():
    print("გამოვედი სახლიდან")
    print("გავუყევი გზას")
    print("გადავჭერი გზა")
    print("შევუხვიე მარცხნივ")
    print("ვიარე წინ")
    print("შევუხვიე მარცხნივ")
    print("გაიარე ციხის გზა")
    print("ჩაუარეთ მარგეს შაურმას")
    print("მივედით მაგაზიაში")




waymarket()
    