// =====================================================

//              დავალება 1-ლი

// =====================================================


// კომენტარის სახით ახსენით რა განსხვავებაა for of / for in შორის

// for of გამოიყენება (Array, String-ზე და სხვა ტიპებზე)
// და გვიბრუნებს ელემენტს (value).

// for in გამოიყენება ობიექტებზე
// და გვიბრუნებს key-ს (ელემენტის სახელს).


// =====================================================

//               დავალება მე-2

// =====================================================


// მომხმარებელს შემოატანინეთ სახელი და ამ სახელის
// თითოეული ასო გამოიტანეთ ცალცალკე for of-ის გამოყენებით

let name = prompt("შეიყვანეთ თქვენი სახელი:");

for (let letter of name) {
  console.log(letter);
}


// =====================================================

// დავალება მე-3

// =====================================================


// შექმენით სია სადაც იქნება სხვადასხვა ტიპის მონაცემები.
// და ახალ სიაში დააბრუნეთ მხოლოდ ის ელემენტები
// რომლებიც იქნება სტრინგ ტიპის მონაცემი (for of-ით)

let mixedArray = [10, "Hello", true, "World", 50, "JavaScript"];
let stringsOnly = [];

for (let item of mixedArray) {
  if (typeof item === "string") {
    stringsOnly.push(item);
  }
}

console.log(stringsOnly);


// =====================================================

// დავალება მე-4

// =====================================================

// შექმენით ობიექტი სადაც შეინახავთ თქვენი საყვარელი
// ფილმის / წიგნის მონაცემებს.
// და კონსოლში გამოიტანეთ სათითაოდ ჯერ key და შემდეგ value.


let favorite = {
  title: "Supernatural",
  genre: "Fantasy",
  year: 2005,
  rating: 10,
};


for (let key in favorite) {
  console.log(key);
}


for (let key in favorite) {
  console.log(favorite[key]);
}


// =====================================================

// დავალება მე-5

// =====================================================


// შექმენით ობიექტი სადაც შეინახავთ ნებისმიერი ტიპის ინფორმაციას.
// მომხმარებელს შემოატანინეთ key.
// თუ ეს key არის ობიექტში მაშინ კონსოლში გამოაჩინეთ შესაბამისი მნიშვნელობა.
// სხვა შემთხვევაში შემოატანინე value და ობიექტში დაამატეთ.

let info = {
  name: "გიორგი",
  age: 18,
};

let userKey = prompt("შეიყვანეთ ელემენტის სახელი:");

if (userKey in info) {
  console.log(info[userKey]);
} else {
  let userValue = prompt("ასეთი ელემენტის სახელი ვერ მოიძებნა, შეიყვანეთ ელემენტი :");
  info[userKey] = userValue;
  console.log(info);
}


// =====================================================

// დავალება მე-6

// =====================================================


// შექმენით სია სადაც იქნება მინიმუმ 5 განსხვავებული ელემენტი.
// ზოგიერთი ელემენტი უნდა მეორდებოდეს.
// შემდეგ შექმენით ობიექტი სადაც ჩაამატებთ ამ ელემენტს როგორც key
// და მისი მნიშვნელობა იყოს რამდენჯერაც გვხვდება სიაში.

let items = ["apple", "banana", "apple", "xawapuri", "banana", "apple"];
let result = {};

for (let item of items) {
  if (result[item]) {
    result[item]++;
  } else {
    result[item] = 1;
  }
}

console.log(result);
