//                   დავალება 1-ლი

// შექმენით 3 ელემენტიანი სია. და სიის დასაწყისში დაამატეთ თქვენი სახელი. და სიის ბოლოდან ამოშალეთ ბოლო ინდექსზე მდგომი ელემენტი

let list = ["ბიძია", "ხაჭაპური", "ლობიანი"]; 

list.unshift("გიორგი"); // სიის დასაწყისში დავამატე ჩემი სახელი

list.pop(); // სიის ბოლოდან ამოვშალეთ ბოლო ინდექსზე მდგომი ელემენტი

console.log(list);


//                    დავალება მე-2

// შექმენით 5 ელემენტიანი სია და სიის ბოლოში დაამატეთ თქვენი ასაკი

let list1 = ["ბატონი", "გიორგი", "არის", "...", "-"]; // 5 ელემენტიანი სია
list.push(15); // სიის ბოლოში დავამატე ჩემი ასაკი 

console.log(list1);


//.                   დავალება მე-3

// შექმენით 5 ელემენტიანი სია. და მე-3 ინდექსზე დაამატეთ "Goa" და ბოლო ელემენტი წაშალეთ.

let list3 = ["ნიუტონს", "ვაშლი", "დაეცა და", "აღმოაჩინა", "მიზიდულობა"]; 
list.splice(3, 0, "Goa"); // მე-3 ინდექსზე დავამატე "Goa"
list.pop(); // ბოლო ელემენტი წავშალე

console.log(list3);