// ==========================================
//                 დავალება 1-ლი

// პირობა: შექმენი ობიექტი ავტომობილების შესახებ --> brand , model , year , color
// შენი დავალებაა რომ შებამისი მეთოდის დახმარებით მიიღო სია სადაც იქნბება კიდევ სიები
// key , value წყვილებით , შენი დავალებაა კონსოლში გამოიტანო key ები ცალკე value ბი ცალკე(გამოიყენე for ან forEach)
// ==========================================
console.log("-----__&__-----");
console.log("დავალება 1-ლი :");
var car = {
  brand: "Chevrolet",
  model: "Impala",
  year: 1967,
  color: "Black",
};

var carEntries = Object.entries(car);

carEntries.forEach(([key, value]) => {
  console.log("Key:" + key, " Value:" + value);
});

// ==========================================
//                 დავალება მე-2
// პირობა: შექმენი ობიექტი შენს შესახხებ --> name , surname , age
// შექმენი მეორე ობიექტი სადაც იქნება --> adress , hobby , favColor
// შენი დავალებაა გააერთიანო ეს ორივე ობიექტი ერთ ობიექტში და შეინახო ცვლადში
// შემდეგ მოახდინე ამ ობიექტის დესტრუქცია და გამოიტანე კონსოლში თითოეული მათგანი
// ==========================================

let personalInfo = {
  name: "მეფე ვახტანგ",
  surname: "გორგასალი",
  age: 15,
};

let extraInfo = {
  adress: "ტბილისი",
  hobby: "ზრუნვაჲ იბერიისაჲ",
  favColor: "მეწამული სისხლისფერი",
};

let mergedObj = { ...personalInfo, ...extraInfo };

let { name, surname, age, adress, hobby, favColor } = mergedObj;
console.log("-----__&__-----");
console.log("დავალება მე-2 :");
console.log("სახელი:", name);
console.log("გვარი:", surname);
console.log("ასაკი:", age);
console.log("მისამართი:", adress);
console.log("მოწოდებაჲ:", hobby);
console.log("საყვარელი ფერი:", favColor);

// ==========================================
//                     დავალება მე-3
// პირობა: შექმენი ობიექტი რომელშიც იქნება მხოლოდ name.
// დაამატე გარედან author , year და amount.
// შეამოწმე არის თუ არა ობიექტში key სახელად name და color.
// ==========================================

var book = {
  name: "ვეფხისტყაოსანი",
};

book.author = "შოთა რუსთაველი";
book.year = 1712;
book.amount = 50;

console.log("-----__&__-----");
console.log("დავალება მე-3");
console.log("არის თუ არა სახელი ობიექტსა შინა? :", "name" in book);
console.log("არის თუ არა ფერი ობიექტში? :", "color" in book);

// ==========================================
//                     დავალება მე-4
// პირობა: შექმენი ობიექტი შენს შესახებ. გამოიტანე ობიექტის
// მნიშვნელობა(მთლიანი ობიექტი) valueOf-ის გამოყენებით.
// ==========================================

var aboutMe = {
  name: "გიორგი",
  age: 15,
  status: "მოსწავლე",
  goal: "მამაო , ფილოსოფოსი, პროგრამისტი , მხატვარი",
};
console.log(aboutMe.valueOf());
