//                        დავალება 1-ლი

// =====================================================
// შექმენი სია სადაც მოათავსებ number ტიპის მონაცემებს.
// შენი დავალებაა რომ კონსოლში გამოიტანო ყველა ლუწი რიცხვი.
// გამოიყენე for...of ციკლი
// =====================================================

let numbers = [3, 6, 9, 12, 15, 18, 21, 24];

for (let num of numbers) {
    if (num % 2 === 0) {
        console.log("ლუწი რიცხვი:", num);
    }
}

//                        დავალება მე-2

// =====================================================
// შექმენი სტრინგი სადაც შეინახავ რაიმე სიტყვას.
// შენი დავალებაა რომ კონსოლში გამოიტანო მხოლოდ ხმოვანი ასოები.
// გამოიყენე for...of ციკლი
// =====================================================

let word = "programming";
let vowels = "aeiou";

for (let charcho of word) {
    if (vowels.includes(charcho)) {
        console.log("ხმოვანი ასო:", charcho);
    }
}


// =========================================

//              დავალება მე-3

// =========================================


let car = {
    name: "Impala",
    brand: "Chevrolet",
    year: 1967,
    color: "Black"
};



for (let key in car) {
    console.log(key);
}


for (let key in car) {
    console.log(car[key]);
}



// =====================================================

//              დავალება მე-4

// =====================================================


// შექმენით ობიექტი სადაც შეინახავთ რამოდენიმე რიცხვს როგორც კენტს ასევე ლუწს,
// თქვენი დავალებაა რომ იპოვოთ ყველა ლუწი რიცხვის ჯამი
// და კენტი რიცხვების რაოდენობა

let nums = {
    num1: 10,
    num2: 7,
    num3: 4,
    num4: 9,
    num5: 12,
    num6: 3
};

let evenSum = 0;
let oddCount = 0;

for (let key in nums) {
    if (nums[key] % 2 === 0) {
        evenSum += nums[key];
    } else {
        oddCount++;
    }
}

console.log("ლუწების ჯამი არის:", evenSum);
console.log("კენტების რაოდენობა არის:", oddCount);
