// =====================================================

//                        switch 

// =====================================================

//                                დავალება 1-ლი

// გააკეთეთ მარტივი კალკულატორი switch / case -ების გამოყენებით.

let num1 = Number(prompt("შეიყვანეთ პირველი რიცხვი :"));
let num2 = Number(prompt("შეიყვანეთ მეორე რიცხვი :"));
let operator = prompt("შეიყვანეთ მოქმედება (+, -, *, /)");

switch (operator) {
  case "+":
    console.log(num1 + num2);
    break;

  case "-":
    console.log(num1 - num2);
    break;

  case "*":
    console.log(num1 * num2);
    break;

  case "/":
    console.log(num1 / num2);
    break;

  default:
    console.log("ასეთი მოქმედება არ არსებობს");
}

//                                               დავალება მე-2

// გააკეთეთ ქულების შემფასებელი. ცვლადში შეინახავთ ასოს (A, B, C, D, E, F) და თუ ცვლადის მნიშვნელობა არის
// A - საუკეთესო ქულა, ყოჩაღ
// B - კარგი ქულაა
// C - საშუალო შედეგი
// D - ცუდი შედეგია, ეცადე უკეთესად
// F - ჩაიჭერი
// სხვა შემთხვევაში - ასეთი შეფასება არ არსებობს.
// გამოიტანეთ კონსოლში შესაბამისი მნიშვნელობები.

let grade = prompt("შეიყვანეთ შეფასება (A, B, C, D, E, F)");

switch (grade) {
  case "A":
    console.log("საუკეთესო ქულა, ყოჩაღ");
    break;

  case "B":
    console.log("კარგი ქულაა");
    break;

  case "C":
    console.log("საშუალო შედეგი");
    break;

  case "D":
    console.log("ცუდი შედეგია, ეცადე უკეთესად");
    break;

  case "F":
    console.log("ჩაიჭერი");
    break;

  default:
    console.log("ასეთი შეფასება არ არსებობს");
}

//                                           დავალება მე-3

// შექმენით ფუნქცია, სადაც არგუმენტად გადაეცემა ფუნქციას მომხმარებლის შემოტანილი რიცხვი.
// switch / case გამოყენებით . თუ ქულა არის
// 100 მაშინ დააბრუნეთ "საუკეთესო შედეგია, ყოჩაღ"
// 90-დან 100 შუალედში - A
// 80-დან 89 შუალედში  - B
// 70-დან 79 შუალედში  - C
// 55-დან 69 შუალედში - D
// 55 -ზე ნაკლებია მაშინ - F
// სხვა შემთხვევაში "არასწორად შემოიტანეთ ქულა"

function checkScore(score) {
  switch (true) {
    case score === 100:
      return "საუკეთესო შედეგია, ყოჩაღ";

    case score >= 90 && score <= 100:
      return "A";

    case score >= 80 && score <= 89:
      return "B";

    case score >= 70 && score <= 79:
      return "C";

    case score >= 55 && score <= 69:
      return "D";

    case score < 55:
      return "F";

    default:
      return "არასწორად შემოიტანეთ ქულა";
  }
}

let userScore = Number(prompt("შეიყვანეთ ქულა :"));
console.log(checkScore(userScore));

// =====================================================

// ternary operator

// =====================================================

//                              დავალება მე-4
// მომხმარებელს შემოატანინეთ რიცხვი და გაიგეთ დადებითია თუ უარყოფითი რიცხვი

let number = Number(prompt("შეიყვანეთ რიცხვი :"));

console.log(number >= 0 ? "დადებითი რიცხვია" : "უარყოფითი რიცხვია");

//                               დავალება მე-5

// შექმენით ცვლადი სადაც შეინახავთ რიცხვ 1000,  მომხმარებელს შემოატანინეთ სტატუსი,
// თუ შემოტანილი მნიშვნელობა არის სტუდენტი მაშინ 1000-ს დაუმატეთ 20%,
// სხვა შემთხვევაში 5%

let money = 1000;
let status = prompt("შეიყვანეთ სტატუსი");

money = status === "სტუდენტი" ? money * 1.2 : money * 1.05;

console.log(money);

//                               დავალება მე-6

// შექმენით ცვლადი სადაც შეინახავთ ასაკს.
// და გამოიტანეთ სრულწლოვანი არის თუ არა პიროვნება

let age = Number(prompt("შეიყვანეთ ასაკი"));

console.log(age >= 18 ? "სრულწლოვანია" : "არ არის სრულწლოვანი");

//                              დავალება მე-7

// მომხმარებელს შემოატანინეთ რიცხვი.
// თუ რიცხვი არის ლუწი მაშინ აიყვანეთ კუბში,
// სხვა შემთხვევაში კვადრატში. (Math ობიექტი გამოიყენეთ)

let num = Number(prompt("შეიყვანეთ რიცხვი"));

let result = num % 2 === 0 ? Math.pow(num, 3) : Math.pow(num, 2);

console.log(result);

// =====================================================

// swicth / case + ternary operator

// =====================================================

//                             დავალება მე-8

// მომხმარებელს შემოატანინეთ კვირის დღე და თანხა. თუ
// ორშაბათია, გაუკეთეთ 5% ფასდაკლება,
// სამშაბათი - 10%
// ოთხშაბათი - 15%
// ხუთშაბათი - 20%
// პარასკევი - 25%
// შაბათი - 50%
// კვირა - 50%
// სხვა შემთხვევაში, "ასეთი დღე ან თანხა არ არსებობს"

let day = prompt("შეიყვანეთ კვირის დღე :");
let price = Number(prompt("შეიყვანეთ თანხა :"));

switch (day) {
  case "ორშაბათი":
    console.log(price * 0.95);
    break;

  case "სამშაბათი":
    console.log(price * 0.9);
    break;

  case "ოთხშაბათი":
    console.log(price * 0.85);
    break;

  case "ხუთშაბათი":
    console.log(price * 0.8);
    break;

  case "პარასკევი":
    console.log(price * 0.75);
    break;

  case "შაბათი":
  case "კვირა":
    console.log(price * 0.5);
    break;

  default:
    console.log("ასეთი დღე ან თანხა არ არსებობს");
}
