//                                               დავალება 1-ლი   

// შექმენი სია სადაც მოთავსებთ 10 ადამიანის სახელს,თქვენი დავალებაა რომ შექმნათ ცვლადი და შეინახოთ ამ ცვლადში შემდეგი მნიშვნელობები --> ელემენტები მესამე ინდექსიდან მე8 ინდექსამდე ////შექმენი მეორე ცვლადი და ამ ცვლადში შეინახე შემდეგი მნიშვნლელობები --> ელემენტები მე0 ინდექსიდან მე6 ინდექსამდე , დააკონსოლლოგეთ ორივე ცვლადი რომ ნახოთ ორივე ცვლადში შენახული შედეგები ======>>>>>> გამოიყენეთ slice() ფუნქცია

let names = [
  "გოგა",
  "მარიამი",
  "ნინო",
  "ლაშა",
  "გიორგი",
  "ანა",
  "დავით აღმაშენებელი",
  "აღა მაჰმად ხანი",
  "ნაპოლეონი",
  "სალომე"
];

// მესამე ინდექსიდან მე8 ინდექსამდე

let sliced1 = names.slice(3, 8);

// მე0 ინდექსიდან მე6 ინდექსამდე

let sliced2 = names.slice(0, 6);


console.log(sliced1 );
console.log(sliced2 );