// =====================================================

//              დავალება 1-ლი

// =====================================================

// შექმენით ცვლადი სადაც შეინახავთ რიცხვს.
// ტერნარი ოპერატორის გამოყენებით დააბრუნეთ შესაბამისი თვე.

var month = 4;

console.log(
    month === 1 ? "იანვარი" :
    month === 2 ? "თებერვალი" :
    month === 3 ? "მარტი" :
    month === 4 ? "აპრილი" :
    month === 5 ? "მაისი" :
    month === 6 ? "ივნისი" :
    month === 7 ? "ივლისი" :
    month === 8 ? "აგვისტო" :
    month === 9 ? "სექტემბერი" :
    month === 10 ? "ოქტომბერი" :
    month === 11 ? "ნოემბერი" :
    month === 12 ? "დეკემბერი" :
    "არასწორი თვე"
);