//                                                დავალება 1-ლი


// while loop - ის გამოყენებით კონსოლში გამოიტანეთ 10-ჯერ თქვენი სახელი.


let i = 0;
while (i < 10) {
  console.log("გიორგი");
  i++;
}



//                                                დავალება მე-2


// While loop -ის გამოყენებით მომხმარებელს შემოატანინეთ სახელი მანამ სანამ არ დაემთხვევა თქვენს სახელს.


let myName = "გიორგი";
let input = prompt("შეიყვანეთ თქვენი სახელი:");

while (input !== myName) {
  input = prompt("არასწორია, სცადეთ ხელახლა :");
}

console.log("მოგესალმებით ბატონო გიორგი!");



//                                                დავალება მე-3


// შექმენით სია და ამ სიის თითოეული ელემენტი გამოიტანეთ while loop-ის გამოყენებით.


let fruits = ["ვაშლი", "ბანანი", "ატამი"];
let index = 0;

while (i < 3) {
  alert(fruits[i])
  index++;
}


//                                                დავალება მე-4


// მომხმარებელის შემოტანილი რიცხვის ჩათვლით გამოიტანეთ ყველა ლუწი რიცხვი while loop-ის გამოყენებით.


let num = Number(prompt("შეიყვანეთ რიცხვი:"));
let j = 0;

while (j <= num) {
  if (j % 2 === 0) {
    console.log(j);
  }
  j++;
}



//                                               დავალება მე-5


// შექმენით 4 სია. ერთში გექნებათ 3 String ტიპის მონაცემი. მეორეში Number ტიპის, მესამეში bool ტიპის და მეოთხეში სიები.


let strings = ["გიორგი", "ნიკოლოზი", "ანა"];
let numbers = [5, 15, 30];
let bools = [true, false, true];
let lists = [[5, 15, 30], ["გიორგი", "ნიკოლოზი" , "ანა"], [true, false, true]];

console.log(strings);
console.log(numbers);
console.log(bools);
console.log(lists);



//                                               დავალება მე-6


// კომენტარის სახით დაწერეთ რა მსგავსება / განსხვავებას ხედავთ while და for loop-ებს შორის.

/*

მსგავსება:

- ორივე ციკლი გამოიყენება გამეორებებისთვის .
 

განსხვავება:

- while loop მუშაობს მანამ, სანამ პირობა ჭეშმარიტია (true).
- for loop- ის პირობა ერთ ხაზზე იწერება while loop ის პირობა კი სხვადასხვა ხაზზე.  
- while loop- ში ჩვენ არ ვიცით რამდენჯერ გაიმეორებს ციკლს.
- while loop- ით  ადვილია უსასრულო ციკლის შექმნა თუ პირობა არ შეიცვლება.(თუ პირობა სულ ჭეშმარითი იქნება)

*/
