//                                               დავალება 1-ლი

// შექმენით ფუნქცია რომელიც
// დააბრუნებს "გამარჯობა {თქვენი სახელი}"-ს და 
// კონსოლში გამოიტანეთ შედეგი.

function greeting(name) {
  return "მოგესალმებით ბატონო " + name;
}

let result = greeting("გიორგი");
console.log(result);

//                                               დავალება მე-2

// შექმენით ფუნქცია, რომელსაც გადაეცემა თქვენი სახელი და ასაკი, 
// და დააბრუნეთ ტექსტი 'გამარჯობა, მე ვარ {სახელი}, და ვარ {ასაკი} წლის. შენ რამდენის ხარ? '
//
// ფუნქციას რომ შექმნით გამოიძახეთ 3-ჯერ, კონსოლში გამოჩნდეს შედეგი 
// და სხვადასხვა მნიშვნელობა გადაეცით

function introduceYourself(name, age) {
  return "მოგესალმებით, მე ვარ " + name + ", და ვარ " + age + " წლის. თქვენ რა გქვიათ და რამდენის წლის ბრძანდებით?";
}

let r1 = introduceYourself("გიორგი", 15);
let r2 = introduceYourself("ნიკა", 17);
let r3 = introduceYourself("ნაპოლეონი", 1400);

console.log(r1);
console.log(r2);
console.log(r3);