// ==========================================
//                დავალება 1-ლი

// შექმენით სია სხვადასხვა ტიპის მონაცემებით. 
// დააბრუნეთ ისეთი ელემენტები, რომლებიც არის სტრინგები.

// ==========================================

var monacemebi1 = [15, "გიორგი", true, "xawapuri", 444, "დავით აღმაშენებელი", null];

var mxolodStringebi = monacemebi1.filter(function(elementi) {
    
    return typeof elementi == "string";
});

console.log("დავალება 1-ლი : სტრინგებია: " + mxolodStringebi);



// ==========================================

//                დავალება მე-2

// შექმენით სია, სადაც იქნება რიცხვები. 
// დააბრუნეთ პირველივე რიცხვი, რომელიც მეტია 100-ზე.

// ==========================================

var ricxvebi2 = [45, 89, 1200, 5, 250, 33];

var pirveliAszeMeti = ricxvebi2.find(function(ricxvi) {
   
    return ricxvi > 100;
});

console.log("დავალება მე-2 : პირველი რიცხვი რომელიც > 100-ზე მეტია : " + pirveliAszeMeti);


// ==========================================

//                დავალება მე-3

// შექმენით სახელების სია. დააბრუნეთ პირველივე 
// ელემენტის ინდექსი, რომლის სიგრძეც მეტია 5-ზე.

// ==========================================

var saxelebi3 = ["ანა", "ლუკა", "ნაპოლეონი", "ნიკოლოზი", "გიორგი"];

var grdzeliSaxelisIndeqsi = saxelebi3.findIndex(function(saxeli) {
    
    return saxeli.length > 5;
});

console.log("დავალება მე-3 : თქვენი პირობის დამაკმაყოფილებელი ელემენტის ინდექსი : " + grdzeliSaxelisIndeqsi);