// ==========================================

//                დავალება 1-ლი

// პირობა: შექმენით სია სადაც იქნება მინიმუმ 7 სტრინგი. 
// დააბრუნეთ ყველაზე გრძელი სიტყვა.

// ==========================================

var sityvebi1 = ["ვაშლი", "მსხალი", "ატამი", "ხურმა", "საზამთრო", "ალუბალი", "მარწყვი" ];

var yvelazeGrdzeli = sityvebi1.reduce(function(a, mimdinare) {
    if (mimdinare.length > a.length) {
        return mimdinare;
    } else {
        return a;
    }
});

console.log("დავალება 1-ლი : ყველაზე გრძელი სიტყვაა: " + yvelazeGrdzeli);


// ==========================================

//                დავალება მე-2

// პირობა: შექმენით სია სადაც იქნება რიცხვები. 
// და შეკრიბეთ ყველაფერი.

// ==========================================

var ricxvebi2 = [10, 20, 30, 40, 50];

var jami2 = ricxvebi2.reduce(function(jami, mimdinare) {
    return jami + mimdinare;
}, );

console.log("დავალება მე-2 : რიცხვების ჯამია: " + jami2);


// ==========================================

//                დავალება მე-3

// პირობა: შექმენით სია სადაც იქნება bool ტიპის მნიშვნელობები. 
// და დააბრუნეთ თუ ამ სიაში ყველა არის true თუ არა.

// ==========================================

var booleanSia3 = [true, true, false, true];

// every() ამოწმებს, ყველა ელემენტი აკმაყოფილებს თუ არა პირობას
var yvelaArisTrue = booleanSia3.every(function(elementi) {
    return elementi === true;
});

console.log("დავალება მე-3 : ყველა არის ჭეშმარიტი? : " + yvelaArisTrue);


// ==========================================

//                დავალება მე-4

// პირობა: შექმენით მასივი სადაც იქნება დუბლიკატი მნიშვნელობები. 
// თქვენი დავალებაა ამოშალოთ დუბლიკატები.

// ==========================================

var dublikatebi4 = [1, 2, 2, 3, 4, 4, 4, 5, 1];


var unikaluriSia = [...new Set(dublikatebi4)];

console.log("დავალება მე-4 : გასუფთავებული სია: " + unikaluriSia);




// ==========================================

//                დავალება მე-6

// პირობა: შექმენით ფუნქცია რომელსაც გადაეცემა არგუმენტად სტრინგი. 
// და ობიექტის სახით დააბრუნეთ თითოეული ასო რამდენჯერ გვხვდება.

// ==========================================

function daitvaleAsoebi(teqst) {
    var shedegi = {};
    
    for (var i = 0; i < teqst.length; i++) {
        var aso = teqst[i];
        
        if (shedegi[aso]) {
            shedegi[aso]++;
        } else {
            shedegi[aso] = 1;
        }
    }
    return shedegi;
}

console.log("დავალება მე-6 : ასოების რაოდენობა: ", daitvaleAsoebi("programming"));      