// =====================================================
//             დავალება 1-ლი

// შექმენით ობიექტი სადაც შეინახავთ თქვენი საყვარელი
// წიგნის / ფილმის სახელს, ავტორს, შეფასებას და
// გამოშვების წელს. თითოეული გამოიტანეთ კონსოლში
// ცალცალკე.
// =====================================================

let favoriteSeries = {
    title: "Supernatural (ზებუნებრივი)",
    creator: "Eric Kripke",
    rating: 10,
    releaseYear: 2005
};

console.log("დავალება 1 - ფილმის სათაური:", favoriteSeries.title);
console.log("დავალება 1 - ფილმის ავტორი:", favoriteSeries.creator);
console.log("დავალება 1 - ფილმის შეფასება:", favoriteSeries.rating);
console.log("დავალება 1 - ფილმის გამოშვების წელი:", favoriteSeries.releaseYear);



// =====================================================
//             დავალება მე-2

// მომხმარებელს შემოატანინეთ მეილი და პაროლი.
// შექმენით ობიექტი და ორივე მნიშვნელობა
// კონსოლში გამოიტანეთ ცალცალკე.
// =====================================================

let email = prompt("შეიყვანეთ თქვენი ელფოსტა:");
let password = prompt("შეიყვანეთ თქვენი პაროლი:");

let user = {
    email: email,
    password: password
};

console.log("დავალება 2 - თქვენი ელფოსტა:", user.email);
console.log("დავალება 2 - თქვენი პაროლი:", user.password);



// =====================================================
//             დავალება მე-3

// შექმენით ობიექტი, ამოშალეთ ორი მნიშვნელობა,
// ერთი გაანახლეთ და დარჩენილი მონაცემები
// კონსოლში გამოიტანეთ ცალცალკე.
// =====================================================

let phone = {
    brand: "Samsung",
    model: "Galaxy S23",
    price: 3000,
    year: 2023
};

delete phone.brand;
delete phone.year;

phone.price = 2700;

console.log("დავალება 3 - ტელეფონის მოდელი:", phone.model);
console.log("დავალება 3 - ტელეფონის ფასი:", phone.price);



// =====================================================
//             დავალება მე-4

// შექმენით ობიექტი თქვენს შესახებ.
// მომხმარებელს შემოატანინეთ ტექსტი და
// ობიექტში ჩაამატეთ. ყველა მონაცემი
// კონსოლში გამოიტანეთ ცალცალკე.
// =====================================================

let myInfo = {
    name: "გიორგი",
    age: 15,
    hobby: "art"
};

let userText = prompt("შეიყვანეთ ნებისმიერი ტექსტი:");
myInfo.additionaliInfo = userText;

console.log("დავალება 4 - ჩემი სახელი:", myInfo.name);
console.log("დავალება 4 - ჩემი წლოვანება:", myInfo.age);
console.log("დავალება 4 - ჩემი ჰობი:", myInfo.hobby);
console.log("დავალება 4 - თქვენს მიერ შეყვანილი დამატებითი ინფორმაცია:", myInfo.additionaliInfo);


// =====================================================
//              დავალება მე-5

// შექმენით სია სადაც შეინახავთ მინიმუმ 5 ობიექტს
// და სცადეთ გამოიტანოთ თითოეული ობიექტში მყოფი
// სახელი ცალცალკე for loop-ის გამოყენებით
// =====================================================

let people = [
    { name: "გიორგი", age: 15 },
    { name: "ნაპოლეონი", age: 150 },
    { name: "ნიკოლას ტესლა", age: 55 },
    { name: "სტალინი", age: 1 },
    { name: "ნიკო ფიროსმანი", age: 88 }
];


for (let i = 0; i < people.length; i++) {
    console.log(people[i].name);
}