//               დავალება 1-ლი

// შექმენით 5 ელემენტიანი სია, სიიდან ამოშალეთ ბოლო ელემენტი და ჩაამატეთ ახალი ელემენტი.

let list1 = ["ვაშლი","მსხალი", "ბანანი", "ატამი", "საზამთრო"];
list1.pop();
list1.push("ფორთოხალი");
console.log(list1);



//                   დავალება მე-2

// შექმენით 5 ელემენტიანი სია, სიიდან ამოშალეთ მე-0 ინდექსზე მდგომი ელემენტი და დაამატეთ ახალი ელემენტი მის მაგივრად.

let list2 = ["სკამი", "მაგიდა", "სარკე", "კარადა", "მდივანი"];
list2.splice(0, 1, "ტელევიზორი");
console.log(list2);



 //                  დავალება მე-3

// შექმენით 5 ელემენტიანი სია, მომხმარებლის შემოტანილი მნიშვნელობა დაამატეთ ამ სიაში იმ შემთხვევაში თუ ეს ელემენტი არ არის სიაში, 
// თუ არის მაშინ ამოშალეთ. და კონსოლში გამოიტანეთ ახალი სია.

let list3 = ["Goa", "JS", "Python", "HTML", "CSS"];
let userValue = prompt("შეიყვანეთ ელემენტი:");

if (list3.includes(userValue)) {
  list3.splice(list3.indexOf(userValue), 1);
} else {
  list3.push(userValue);
}

console.log(list3);



 //                  დავალება მე-4

// შექმენით 10 ელემენტიანი სია. მომხმარებელს შემოატანინეთ რიცხვი, 
// შემოტანილი რიცხვი გამოიყენეთ როგორც ინდექსად და მომდევნო სამი ელემენტი წაშალეთ. შედეგი გამოიტანეთ კონსოლში.

let list4 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100];
let index = Number(prompt("შეიყვანეთ ინდექსი (0-დან 9-მდე) :"));
list4.splice(index, 3);
console.log(list4);



//                   დავალება მე-5

// შექმენით 10 ელემენტიანი სია. მე-2 ინდექსზე მყოფი ელემენტი შეცვალეთ თქვენი სახელით, 
// და მე-6დან მე-8 ინდექსის ჩათვლით ელემენტები წაშალეთ და ჩასვით 'Goa academy'

let list5 = ["მე", "ო", "პ", "d", "e", "f", "g", "h", "i", "j"];
list5[2] = "გიორგი";
list5.splice(6, 3, "Goa academy");
console.log(list5);



//                   დავალება მე-6

// შექმენით 3 ელემენტიანი სია. სიის ბოლოდან ამოშალეთ ბოლო ელემენტი.

let list6 = ["ნიკოლოზი", "გიორგი", "ანა"];
list6.pop();
console.log(list6);



//                   დავალება მე-7

// შექმენით 3 ელემენტიანი სია და სიის დასაწყისიდან ამოშალეთ ელემენტი.

let list7 = ["კომპიუტერი", "მაუსი", "კლავიატურა"];
list7.shift();
console.log(list7);



 //                  დავალება მე-8

// შექმენით 3 ელემენტიანი სია და სიის დასაწყისში ჩაამათეთ რიცხვი.

let list8 = ["ლამპა", "ტელევიზორი", "კარადა"];
list8.unshift(333);
console.log(list8);



//                   დავალება მე-9

// შექმენით 3 ელემენტიანი სია და სიის ბოლოში დაამატეთ ნებისმიერი სტრინგი.

let list9 = ["ხაჭაპური", "ლობიანი", "ღომი"];
list9.push("Goa");
console.log(list9);



//                   დავალება მე-10

// მოცემული გაქვთ სია: 
// [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 40, 50, 110, 120]
// შესაბამისი მეთოდების გამოყენებით გამოიტანეთ
// *. 40 - ის ინდექსები ;
// *. 30 - ის ინდექსი ;

let list10 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 40, 50, 110, 120];

let index30 = list10.indexOf(30);


console.log("30-ის ინდექსია :", index30);
