# დავალება 1-ლი
# მოცემულია რიცხვი, დაბრუნეთ მისი უარყოფითი ვერსია.
# თუ რიცხვი უკვე უარყოფითია, დააბრუნეთ როგორც არის.
def make_negative(number):
    return -abs(number)


# დავალება მე-2
# ტექსტიდან ამოიღეთ პირველი და ბოლო სიმბოლო.
def remove_char(s):
    return s[1:-1]


# დავალება მე-3
# რიცხვების სიიდან თითოეული რიცხვის კვადრატების ჯამის პოვნა.
def square_sum(numbers):
    return sum(x ** 2 for x in numbers)


# დავალება მე-4
# ტექსტიდან ყველა ცარიელი ადგილი (space) უნდა ამოიღოთ.
def no_space(x):
    return x.replace(" ", "")