//                 დავალება 1-ლი

// 1) for ციკლი 0-დან 20-მდე
for (i = 0; i <= 20; i++) {
  console.log(i);
}

//                 დავალება მე-2

// 2) for ციკლი 5-დან 50-მდე
for (i = 5; i <= 50; i++) {
  console.log(i);
}

//                 დავალება მე-3

// 3) for ციკლი 10-დან 100-მდე 5 ის გამოტოვებით                                                                                                                                                                                        
for (i = 10; i <= 100; i += 5) {
  console.log(i);
}

//                 დავალება მე-4

// 4) სახელის გამოტანა კონსოლში 20-ჯერ
for (i = 1; i <= 20; i++) {
  console.log("გიორგი");
}

//               დავალება მე-5

// for ციკლი 20-ჯერ — giorgi1, giorgi2 ... giorgi20
for (i = 1; i <= 20; i++) {
  console.log("giorgi" + i);
}


//               დავალება მე-6

// ცვლადი, სადაც შენახულია რიცხვი — ციკლი 0-დან ამ რიცხვამდე
let number = 10;
for (i = 0; i <= number; i++) {
  console.log(i);
}

//               დავალება მე-7

// ორი ცვლადი — ციკლი პირველიდან მეორემდე
let start = 5;
let end = 15;
for (i = start; i <= end; i++) {
  console.log(i);
}

//               დავალება მე-8

// მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ჩათვლით გამოიტანეთ ყველა რიცხვი
let num1 = Number(prompt("შეიყვანეთ რიცხვი:"));
for (i = 0; i <= num1; i++) {
  console.log(i);
}

//              დავალება მე-9

// მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ჩათვლით გამოიტანეთ ყველა ლუწი რიცხვი
let num2 = Number(prompt("შეიყვანეთ რიცხვი:"));
for (i = 0; i <= num2; i++) {
  if (i % 2 === 0) {
    console.log(i);
  }
}

//             დავალება მე-10

// მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვიდან 0-მდე გამოიტანეთ ყველა რიცხვი
let num3 = Number(prompt("შეიყვანეთ რიცხვი:"));
for (i = num3; i >= 0; i--) {
  console.log(i);
}
