// ==========================================
// დავალება 1-ლი: თეორიული ახსნა
// ==========================================

/* რა არის DOM (Document Object Model)?
   როდესაც ბრაუზერი ტვირთავს HTML ფაილს, ის მას გარდაქმნის ობიექტების სტრუქტურად, 
   რომელსაც "DOM ის მუხა "ეწოდება. JavaScript-ს სწორედ ამ DOM-ის საშუალებით 
   შეუძლია HTML ელემენტების პოვნა, წაშლა, შეცვლა ან ახლის დამატება რეალურ დროში.

   განსხვავებები მეთოდებს შორის:
   
   1. document.getElementById("იდენტიფიკატორი")
      - ეძებს და აბრუნებს მხოლოდ ერთ, კონკრეტულ ელემენტს უნიკალური ID-ით.
      - თუ ასეთი ID არ არსებობს, აბრუნებს არაფერს

   2. document.getElementsByClassName("კლასის_სახელი")
      - ეძებს ყველა ელემენტს, რომელსაც აქვს ეს კლასი.
      - აბრუნებს HTML კოლექციას (HTMLCollection), რომელიც მასივის მსგავსია.

   3. document.getElementsByTagName("თეგის_სახელი")
      - ეძებს ყველა ელემენტს თეგის ტიპის მიხედვით (მაგალითად: "p", "div", "img").
      - ესეც აბრუნებს HTML კოლექციას (HTMLCollection).
      
   💡 ID-ის დროს მეთოდის სახელი მხოლობითშია (Element), 
      ხოლო კლასის და თეგის დროს — მრავლობითში (Elements).
*/

// ==========================================
// დავალება მე-2: 10 პარაგრაფის ტექსტების გამოტანა
// ==========================================

var paragraphs = document.getElementsByClassName("my-paragraph");


for (var p of paragraphs) {
  
  console.log("პარაგრაფის ტექსტი: " + p.textContent);
}

// ==========================================
// დავალება მე-3: სურათის პოვნა თეგის მიხედვით
// ==========================================


var allImages = document.getElementsByTagName("img");


var singleImage = allImages[0];
console.log("დაფიქსირდა სურათი:", singleImage);

// ==========================================
// დავალება მე-4: ღილაკების პოვნა ID-ის საშუალებით
// ==========================================


var btnSave = document.getElementById("save-btn");
var btnDelete = document.getElementById("delete-btn");

console.log("შენახვის ღილაკი:", btnSave);
console.log("წაშლის ღილაკი:", btnDelete);

// ==========================================
// დავალება მე-5: ინპუტების რაოდენობის გაგება
// ==========================================


var inputsCollection = document.getElementsByClassName("form-input");


console.log(
  "შესაბამისი კლასის მქონე ინპუტების რაოდენობაა: " + inputsCollection.length,
);


// ==========================================
// დავალება მე-6: დივის შიგნით მყოფი ყველა თეგის გამოტანა
// ==========================================

var parentBox = document.getElementById("main-box");

// 2. თვისება .children გვიბრუნებს ამ დივის შიგნით მყოფ ყველა შვილობილ HTML თეგს
var childElements = parentBox.children;

console.log("დივის შიგნით არსებული ყველა თეგი:", childElements);
