//                                               დავალება 1-ლი

// თუ რიცხვი იყოფა 2-ზე და არ იყოფა 5-ზე, კონსოლში დაწერე "რიცხვი ლუწია და არა 5-ის ჯერადი",
// სხვა შემთხვევაში "სხვა შემთხვევა"

console.log('------------*|*-------------')
let numn000 = alert(" სანამ თითოეული დავალების პირობას შეასურლებდეთ გთხოვთ დაიმახსოვრეთ !  ~~ იმისთვის რომ იხილოთ  თქვენს მიერ შეტანილი პასუხების შედეგი ,გთხოვთ  შეამოწმეთ console -ი ~~ ")

let numn1 = alert("დავალება 1-ლი :")
console.log('დავალება 1-ლი :')
let num = Number(prompt("შეიყვანეთ ნებისმიერი რიცხვი :"))

if (num % 2 === 0 && num % 5 !== 0) {
  console.log('რიცხვი ლუწია და არა 5-ის ჯერადი')
} else {
  console.log('პირობა და თქვენს მიერ შეყვანილი პასუხი არ ემთხვევა ')
}

console.log('-------------------------')


//                                               დავალება მე-2

// თუ ქულა 90-ზე მეტია → "შესანიშნავი!"
// თუ 70–90 შორისაა → "კარგია!"
// თუ 50–70 შორისაა → "საშუალო შედეგი!"
// თუ ნაკლებია 50-ზე → "მეტი უნდა იმეცადინო!"

let numn2 = alert("დავალება მე-2 :")
console.log('დავალება მე-2 :')
let score = Number(prompt('შეივანეთ გამოცდაზე დაგროვებული ქულების რაოდენობა (0-100) :'))

if (score > 90) {
  console.log('შესანიშნავია !')
} else if (score >= 70 && score <= 90) {
  console.log('კარგია !')
} else if (score >= 50 && score < 70) {
  console.log('საშუალო შედეგია !')
} else {
  console.log('მეტი მეცადინეობა გჭირდებათ')

}

console.log('-------------------------')


//                                               დავალება მე-3

// თუ ტოლია — "სიტყვები ემთხვევა",
// თუ მხოლოდ პირველი ასოები ემთხვევა — "პირველი ასოები ემთხვევა"
// სხვა შემთხვევაში — "არ ემთხვევა".

let numn3 = alert("დავალება მე-3 :")
console.log('დავალება მე-3 :')
let word1 = prompt('შეიყვანეთ პირველი სიტყვა :')
let word2 = prompt('შეიყვანეთ მეორე სიტყვა :')

if (word1 === word2) {
  console.log('სიტყვები ემთხვევა')
} else if (word1[0] === word2[0]) {
  console.log('პირველი ასოები ემთხვევა')
} else {
  console.log('თქვენს მიერ შეყვანილ სიტყვებში არც ერთი ასო არ ემთხვევა ერთმანეთს , შეიყვანეთ სიტყვები თავიდან')
}

console.log('-------------------------')


//                                               დავალება მე-4

// თუ ასაკი 20-ზე ნაკლებია და ენერგია მეტია 7-ზე → "გირჩევ სირბილს!",
// თუ ენერგია ნაკლებია 4-ზე → "გირჩევ დასვენებას!",
// სხვა შემთხვევაში → "გააგრძელე ჩვეულებრივად!"

let numn4 = alert("დავალება მე-4 :")
console.log('დავალება მე-4 :')
let age = Number(prompt('შეივანეთ თქვენი წლოვანება :'))
let energy = Number(prompt('შეიყვანეთ თქვენი ენერიის დონე (1-10):'))

if (age < 20 && energy > 7) {
  console.log('გირჩევთ სირბილს!')
} else if (energy < 4) {
  console.log('გირჩევთ დასვენებას!')
} else {
  console.log('გააგრძელეთ ჩვეულებისამებრ!')
}

console.log('-------------------------')


//                                               დავალება მე-5 

// თუ ტოლია 7-ის ან 3-ის → "გაიმარჯვე!",
// თუ მეტი 8-ზე → "ძალიან მაღალი!",
// თუ ნაკლებია 2-ზე → "ძალიან დაბალია!",
// სხვა შემთხვევაში → "ცადე კიდევ!".

let numn5 = alert("დავალება მე-5 :")
console.log('დავალება მე-5 :')
let number = Number(prompt('შეიყვანეთ რიცხვი (1-10):'))

if (number === 7 || number === 3) {
  console.log('თქვენ გაიმარჯვეთ გილოცავთ !')
} else if (number > 8) {
  console.log('ზედმეტად მაღალია!')
} else if (number < 2) {
  console.log('ძალიან დაბალია!')
} else {
  console.log('ცადეთ ხელახლა!')
}

console.log('------------*|*-------------')