//                                               დავალება 1-ლი

// for loop - ის გამოყენებით გამოიტანეთ 0-დან 200-მდე რიცხვები.

console.log ('------------*|*-------------')
for (i = 0; i <= 200; i++) {
  console.log(i);
}
console.log('-------------------------')

//                                               დავალება მე-2

// for loop - ის გამოყენებით გამოიტანეთ რიცხვები 5-დან 300-მდე 10-ის მიმატებით.

for (i = 5; i <= 300; i += 10) {
  console.log(i);
}
console.log('-------------------------')

//                                               დავალება მე-3

// for loop-ის გამოყენებით 100-დან 1-ის ჩათვლით უკუსვლით გამოიტანეთ ყველა რიცხვი.

for (i = 100; i >= 1; i--) {
  console.log(i);
}
console.log('-------------------------')

//                                               დავალება მე-4

// for loop - ის გამოყენებით, მომხმარებლის შემოტანილი რიცხვის ჩათვლით შეკრიბეთ ყველა რიცხვი და გამოიტანეთ საბოლოო ჯამი.

let num = prompt("შეიყვანეთ რიცხვი:");
let sum = 0;
for (i = 1; i <= num; i++) {
  sum = sum + i;
}
console.log("საერთო ჯამი არის: " + sum);

//                                               დავალება მე-5

// 4-დან 100-მდე გამოიტანეთ ყველა კენტი რიცხვი. ოღონდ შეამოწმეთ if/else-თი.

for (i = 4; i <= 100; i++) {
  if (i % 2 !== 0) {
    console.log(i);
  }
}
console.log('-------------------------')

//                                               დავალება მე-6

// მომხარებლის შემოტანილი რიცხვის ჩათვლით გამოიტანეთ ყველა რიცხვი და გვერდით ეწეროს ლუწია თუ კენტი. მაგალითად ასე: 
// “1 არის კენტი”
// “2 არის ლუწი”

let num2 = prompt("შეიყვანეთ რიცხვი:");
for (i = 1; i <= num2; i++) {
  if (i % 2 === 0) {
    console.log(i + " არის ლუწი");
  } else {
    console.log(i + " არის კენტი");
  }
}
console.log('-------------------------')

//                                               დავალება მე-7

// მომხმარებელს შემოატანინეთ ორი რიცხვი. და ამ ორი რიცხვის შიგნით მყოფი ყველა რიცხვი შეკრიბეთ.

let num3 = prompt("შეიყვანეთ პირველი რიცხვი:");
let num4 = prompt("შეიყვანეთ მეორე რიცხვი:");
let sum2 = 0;

for ( i = Number(num3) + 1; i < Number(num4); i++) {
   sum2 = sum2 + i;
}

console.log("ორ რიცხვს შორის მყოფი რიცხვების ჯამი არის: " + sum2);

console.log('------------*|*-------------')
