// ==========================================
//                 დავალება 1-ლი

// პირობა: შექმენი ობიექტი robot, რომელსაც ექნება model და მეთოდი sayModel. 
// გამოიყენე this, რომ მეთოდმა დააბრუნოს "ჩემი სახელია {model}"
// ==========================================

var robot = {
    model: "optimus prime",
    sayModel() {
        
        return "ჩემი სახელია " + this.model + " " + "დედამიწაზე მე კაცობრიობის დასახსნელად მოვედი";
    }
};


// ==========================================
//                 დავალება მე-2

// პირობა: შექმენი ობიექტი, სადაც ერთი მეთოდი იქნება ჩვეულებრივი function, 
// ხოლო მეორე arrow function. ორივეში გამოიყენე this, ნახეთ რომელი იმუშავებს.
// ==========================================

var testObject = {
    name: "გარისკავ ბიძიას ოქრო კაცი ?",
    
    regularMethod: function() {
        return this.name; // იმუშავებს! და დააბრუნებს "გარისკავ ბიძიას ოქრო კაცი ? " -ს
    },
    
    arrowMethod: () => {
        return this.name; // არ იმუშავებს! და დააბრუნებს undefined-ს
    }
};


// ==========================================
//                 დავალება მე-3

// პირობა: შექმენი ობიექტი bankAccount, სადაც _balance იქნება private. 
// შექმენი getter, რომელიც დააბრუნებს ბალანსს ფორმატირებულად (მაგ: "$123") 
// და setter, რომელიც დაუშვებს ბალანსის შეცვლას მხოლოდ იმ შემთხვევაში, 
// თუ ახალი მნიშვნელობა დადებითი რიცხვია.
// ==========================================

let bankAccount = {
    _balance: 100, 

    get balance() {
        return "USD " + this._balance; 
    },

    set balance(newAmount) {
        if (typeof newAmount === "number" && newAmount >= 0) {
            this._balance = newAmount;
        } else {
            console.log("შეცდომა: თქვენს ანგარიშზე ბალანსი უნდა იყოს დადებითი რიცხვი! ");
        }
    }
};


// ==========================================
//                 დავალება მე-4

// პირობა: შექმენი ობიექტი სახელად user. Setter-ის გამოყენებით გააკეთეთ ისე, 
// რომ მომხმარებლის სახელი (username) იყოს მინიმუმ 5 სიმბოლო, სხვა შემთხვევაში დააბრუნოს შეცდომა.
// ==========================================

var user = {
    _username: "Tsibelius",

    get username() {
        return this._username;
    },

    set username(newName) {
        if (newName.length >= 5) {
            this._username = newName;
        } else {
            console.log("ამოცნობილია ანომალია : სახელი უნდა შეიცავდეს მინიმუმ 5 სიმბოლოს!");
        }
    }
};


// ==========================================
//                 დავალება მე-5

// პირობა: დაწერე Factory Function, რომელიც აბრუნებს მოტოციკლეტის/მანქანის ინფორმაციებს. 
// გამოიყენე Property Value Shorthand კოდის შესამცირებლად.
// ==========================================

function vehicleFactory(brand, model, type) {
    return {
        brand,
        model,
        type
    };
}


// ==========================================
//                 დავალება მე-6

// პირობა: დაწერე ფუნქცია, რომელიც იღებს id, name და price პარამეტრებს 
// და აბრუნებს ობიექტს
// ==========================================

function createProduct(id, name, price) {
    return {
        id,
        name,
        price
    };
}




// ==========================================
//                 დავალება მე-8

// პირობა: შექმენით ფუნქცია სახელად displayCar, რომელიც პარამეტრად მიიღებს ობიექტს. 
// პარამეტრების სიაშივე მოახდინეთ დესტრუქცია ({brand, model, year})
// ==========================================

function displayCar({ brand, model, year }) {
    
    console.log("მანქანა: " + brand + " " + model + ", გამოშვების წელი: " + year);
}


// ==========================================
//                 დავალება მე-9

// პირობა: შექმენით ორი ობიექტი. პირველ ობიექტში უნდა იყოს id, სახელი, გვარი, დაბადების დღე. 
// მეორე ობიექტში იგივე id, მეილი, პაროლი. ეს ორი ობიექტი გაერთიანეთ.
// ==========================================

let profileBase = {
    id: 99,
    firstName: "შოთა",
    lastName: "რუსთაველი",
    birthDate: "დედამიწას მოევლინა მაშინ როდესაც საჭირო იყო კაცობრიობიოსთვის მჭერმეტყველი კაცი"
};

let profileSecurity = {
    id: 99, 
    email: "vepxistyaosani@iberia.com",
    password: "gvels xvrelidan amoyvanas , ena tkbili moubari"
};

var fullUserProfile = { ...profileBase, ...profileSecurity };