//                                               დავალება 1-ლი 

// შექმენით ფუნქცია რომელიც მომხმარებელს მიესალმება, 'გამარჯობა {მომხმარებლის შემოტანილი სახელი} (გამოძახების დროს უკვე იმ ცვლადს გადასცემთ მნიშვნელობად სადაც ინახავთ შემოტანილ მნიშვნელობას.

function greet(name) {
    console.log("მოგესალმებით ბატონო" + name);
}

let n1 = "გიორგი";
let n2 = "ლუკა";
let n3 = "დიმიტრი";

console.log("დავალება 1-ლი :") 
greet(n1);
greet(n2);
greet(n3);


//                                               დავალება მე-2  

// შექმენით კალკულატორის ფუნქცია,  გადაეცეს სამი არგუმენტი. ორი რიცხვი და 1 მოქმედება უნდა იყოს.

function calcu(a, b, c) {
    if (c === "+") {
        console.log(a + b);
    } else if (c === "-") {
        console.log(a - b);
    } else if (c === "*") {
        console.log(a * b);
    } else if (c === "/") {
        console.log(a / b);
    } else {
        console.log("თქვენს მიერ შეყვანილი მნიშვნელობა არ მოიძებნა მოცემულ მოქმედებებში");
    }
}

console.log("დავალება მე-2 :") 
calcu(5, 3, "+");
calcu(10, 5, "*");
calcu(9, 3, "-");


//                                               დავალება მე-3

// შექმენით ფუნქცია, რომელსაც გადაეცემა არგუმენტად სია. ამ სიაში უნდა იყოს მინიმუმ 5 რიცხვი. ფუნქციამ უნდა დააბრუნოს ამ სიაში მყოფი რიცხვების ჯამი.

function sumList(list) {
    let sum = 0;
    for (let i = 0; i < list.length; i++) {
        sum += list[i];
    }
    console.log(sum);
}

console.log("დავალება მე-3 :") 
sumList([1, 2, 3, 4, 5]);
sumList([10, 20, 30, 40, 50]);
sumList([5, 5, 5, 5, 5]);


//                                               დავალება მე-4    

// შექმენით ფუნქცია, რომელსაც გადაეცემა არგუმენტად რიცხვი. დააბრუნეთ ამ რიცხვის კუბი.

function cube(n) {
    console.log(n * n * n);
}

console.log("დავალება მე-4 :") 
cube(3);
cube(5);
cube(10);



// შექმენით ფუნქცია, რომელსაც გადაეცემა არგუმენტად სახელი. და დააბრუნეთ არის თუ არა თქვენი სახელის ტოლი.

function isMyName(name) {
    if (name === "გიორგი") {
        console.log(true);
    } else {
        console.log(false);
    }
}

console.log("დავალება მე-5 :") 
isMyName("გიორგი");
isMyName("ანა");
isMyName("ლუკა");


//                                               დავალება მე-6 

// შექმენით ფუნქცია რომელსაც გადაეცემა რიცხვი. და 1-დან ამ რიცხვის ჩათვლით ყველა რიცხვს შეკრიბავს.

function sumi(n) {
    let s = 0;
    for (let i = 1; i <= n; i++) {
        s += i;
    }
    console.log(s);
}

console.log("დავალება მე-6 :") 
sumi(5);
sumi(10);
sumi(3);