//                       დავალება 1-ლი     

// =====================================================
//  შექმენით ცვლადი რომლის მნიშვნელობაც იქნება false.
// შემდეგ მეორე ცვლადში შეინახეთ ეს ცვლადი იმ შემთხვევაში თუ ექნება მნიშვნელობა,
// სხვა შემთხვევაში თქვენი სახელი.
// კომენტარის სახით ახსენით რას გამოიტანს და რატომ
// =====================================================

let firstValue = false;

let secondValue = firstValue || "Giorgi";

console.log(secondValue);

// გამოიტანს "Giorgi"-ს
// რადგან firstValue არის false 
// ამიტომ || ოპერატორი დააბრუნებს შემდეგ მნიშვნელობას


//                       დავალება მე-2    

// =====================================================
// შექმენით სია, სადაც იქნება ნებისმიერი ტიპის მონაცემი.
// და წამოიღეთ რენდომულად რომელიმე ინდექსზე მყოფი სიმბოლო.
// =====================================================

let arr = [25, "Hello", true, 99, "GOA", false];

let randomIndex = Math.floor(Math.random() * arr.length);

console.log(arr[randomIndex]);


//                       დავალება მე-3     

// =====================================================
// გააკეთეთ პატარა თამაში.
// მომხმარებელმა უნდა შემოიტანოს 1-დან 100-მდე რენდომ რიცხვი.
// და უნდა გამოიცნოს რენდომ რიცხვი.
// იმ შემთხვევაში თუ მომხმარებლის შემოტანილ რიცხვს და ჩაფიქრებულ რიცხვს შორის
// შუალედი 10-ზე ნაკლებია. მიანიშნოს მომხმარებელს რომ გამოცნობასთან ძალიან ახლოს არის.
// სხვა შემთხვევაში უთხრას მეტია თუ ნაკლები.
// =====================================================

let secretNumber = Math.floor(Math.random() * 100) + 1;

let userNumber = Number(prompt("შეიყვანეთ რიცხვი 1-დან 100-მდე"));

let difference;

if (userNumber > secretNumber) {
  difference = userNumber - secretNumber;
} else {
  difference = secretNumber - userNumber;
}

if (difference < 10) {
  console.log("თითქმის მიზანში ამოიღე");
} else if (userNumber > secretNumber) {
  console.log("ჩაფიქრებულ რიცხვზე მეტია თქვენს მიერ შეყვანილი რიცხვი");
} else {
  console.log("ჩაფიქრებულ რიცხვზე ნაკლებია თქვენს მიერ შეყვანილი რიცხვი");
}


//                       დავალება მე-4     

// =====================================================
// შექმენი პროგრამა, სადაც მომხმარებელი შეიყვანს რიცხვს.
// ეს რიცხვი იქნება პაროლი.
// პროგრამამ უნდა დაითვალოს რამდენად ძლიერია მომხმარებლის მიერ შეყვანილი პაროლი.
// და შეამოწმოს ნამდვილად რიცხვი არის თუ არა.
//
// 1. თუ შეყვანილი სიმბოლოების რაოდენობა მეტია ან ტოლი 6-ზე მაშინ +10 ქულა.
//    თუ 3-6 შუალედშია სიმბოლოების რაოდენობა მაშინ 5 ქულა.
//    სხვა შემთხვევაში 0.
//
// 2. თუ ამ რიცხვის ციფრთა ჯამი მეტია 20-ზე მაშინ +10 ქულა.
//    თუ 15-20 შუალედშია მაშინ 5 ქულა.
//    სხვა შემთხვევაში 0 ქულა.
//
// თუ ქულების საერთო ჯამი მეტი იქნება 15-ზე მაშინ დააბრუნეთ რომ
// "პაროლი არის ძლიერი".
// თუ 10-დან 15-მდეა მაშინ "საშუალო სირთულის"
// სხვა შემთხვევაში დააბრუნეთ "პაროლი სუსტია".
// (string-ად არ გადააქციოთ ეს რიცხვი და ისე არ გაიგთ ციფრთა ჯამი ან სიგრძე.)
// =====================================================

let password = Number(prompt("შეიყვანე რიცხვითი პაროლი"));

if (password >= 0) {
  let score = 0;

  
  let temp = password;
  let length = 0;

  while (temp > 0) {
    temp = Math.floor(temp / 10);
    length++;
  }

  if (length >= 6) {
    score += 10;
  } else if (length >= 3 && length <= 6) {
    score += 5;
  }

  
  temp = password;
  let sum = 0;

  while (temp > 0) {
    sum += temp % 10;
    temp = Math.floor(temp / 10);
  }

  if (sum > 20) {
    score += 10;
  } else if (sum >= 15 && sum <= 20) {
    score += 5;
  }

  if (score > 15) {
    console.log("თქვენს მიერ შეყვანილი პაროლი მძლავრია");
  } else if (score >= 10) {
    console.log("თქვენს მერ შეყვანილი პაროლი საშუალო სირთულის არის");
  } else {
    console.log("თქვენს მიერ შეყვანილი პაროლი სუსტია");
  }
} else {
  console.log("შეყვანილი მნიშვნელობა არ შეესაბამება ჩვენს მოთხოვნას");
}
